#include <inttypes.h>
#include "decoder.h"
#include "util.h"

const char * const kana[256] = {
    "あ", "い", "う", "え", "お", "か", "き", "く", "け", "こ", "さ", "し", "す", "せ", "そ", "た",
    "ち", "つ", "て", "と", "な", "に", "ぬ", "ね", "の", "は", "ひ", "ふ", "へ", "ほ", "ま", "み",
    "む", "め", "も", "や", "ゆ", "よ", "ら", "り", "る", "れ", "ろ", "わ", "を", "ん", "ゔ", "が",
    "ぎ", "ぐ", "げ", "ご", "ざ", "じ", "ず", "ぜ", "ぞ", "だ", "ぢ", "づ", "で", "ど", "ば", "び",
    "ぶ", "べ", "ぼ", "ぱ", "ぴ", "ぷ", "ぺ", "ぽ", "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "っ", "ゃ", "ゅ",
    "ょ", "ア", "イ", "ウ", "エ", "オ", "カ", "キ", "ク", "ケ", "コ", "サ", "シ", "ス", "セ", "ソ",
    "タ", "チ", "ツ", "テ", "ト", "ナ", "ニ", "ヌ", "ネ", "ノ", "ハ", "ヒ", "フ", "ヘ", "ホ", "マ",
    "ミ", "ム", "メ", "モ", "ヤ", "ユ", "ヨ", "ラ", "リ", "ル", "レ", "ロ", "ワ", "ヲ", "ン", "ヴ",
    "ガ", "ギ", "グ", "ゲ", "ゴ", "ザ", "ジ", "ズ", "ゼ", "ゾ", "ダ", "ヂ", "ヅ", "デ", "ド", "バ",
    "ビ", "ブ", "ベ", "ボ", "パ", "ピ", "プ", "ペ", "ポ", "ァ", "ィ", "ゥ", "ェ", "ォ", "ッ", "ャ",
    "ュ", "ョ", "ー", "～", "<A4>", "<A5>", "<A6>", "０", "１", "２", "３", "４", "５", "６", "７", "８",
    "９", "⇧", "⇩", "⇦", "⇨", "！", "？", "＋", "－", "／", "．", "＆", "＃", "♡", "☆", "（",
    "）", "『", "』", "・", "<C4>", "<C5>", "星", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<br>", "<wait>", NULL, "<kana>", "<latin>", "<kanji>", "<icon>", "　", "<F8>", "<F9>", "<FA>", "<scroll>", NULL, NULL, "<FE>", NULL
};

const char * const latin_j[256] = {
    "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ",
    "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "ｚ", "<1B>", "<1C>", "<1D>", "<1E>", "<1F>",
    "<20>", "<21>", "<22>", "<23>", "<24>", "<25>", "<26>", "<27>", "<28>", "<29>", "<2A>", "<2B>", "<2C>", "<2D>", "<2E>", "<2F>",
    "<30>", "<31>", "<32>", "<33>", "<34>", "<35>", "<36>", "<37>", "<38>", "<39>", "<3A>", "<3B>", "<3C>", "<3D>", "<3E>", "<3F>",
    "<40>", "<41>", "<42>", "<43>", "<44>", "<45>", "<46>", "<47>", "<48>", "<49>", "<4A>", "<4B>", "<4C>", "<4D>", "<4E>", "<4F>",
    "<50>", "<51>", "<52>", "<53>", "<54>", "<55>", "<56>", "<57>", "<58>", "<59>", "<5A>", "<5B>", "<5C>", "<5D>", "<5E>", "<5F>",
    "<60>", "<61>", "<62>", "<63>", "<64>", "<65>", "<66>", "<67>", "<68>", "<69>", "<6A>", "<6B>", "<6C>", "<6D>", "<6E>", "<6F>",
    "<70>", "<71>", "<72>", "<73>", "<74>", "<75>", "<76>", "<77>", "<78>", "<79>", "<7A>", "<7B>", "<7C>", "<7D>", "<7E>", "<7F>",
    "<80>", "<81>", "<82>", "<83>", "<84>", "<85>", "<86>", "<87>", "<88>", "<89>", "<8A>", "<8B>", "<8C>", "<8D>", "<8E>", "<8F>",
    "<90>", "<91>", "<92>", "<93>", "<94>", "<95>", "<96>", "<97>", "<98>", "<99>", "<9A>", "<9B>", "<9C>", "<9D>", "<9E>", "<9F>",
    "<A0>", "<A1>", "<A2>", "<A3>", "<A4>", "<A5>", "<A6>", "<A7>", "<A8>", "<A9>", "<AA>", "<AB>", "<AC>", "<AD>", "<AE>", "<AF>",
    "<B0>", "<B1>", "<B2>", "<B3>", "<B4>", "<B5>", "<B6>", "<B7>", "<B8>", "<B9>", "<BA>", "<BB>", "<BC>", "<BD>", "<BE>", "<BF>",
    "<C0>", "<C1>", "<C2>", "<C3>", "<C4>", "<C5>", "<C6>", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<br>", "<F1>", NULL, "<kana>", "<latin>", "<kanji>", "<icon>", "　", "<F8>", "<F9>", "<FA>", "<scroll>", NULL, NULL, "<FE>", NULL
};

const char * const kanji[256] = {
    "上", "下", "左", "右", "中", "東", "西", "南", "北", "一", "二", "三", "名", "国", "城", "姫",
    "大", "王", "花", "世", "界", "草", "気", "間", "門", "家", "地", "岩", "駅", "山", "海", "火",
    "水", "氷", "日", "根", "雲", "口", "原", "前", "店", "天", "森", "木", "力", "空", "人", "島",
    "出", "入", "本", "石", "村", "休", "先", "見", "近", "方", "法", "手", "紙", "引", "場", "所",
    "使", "回", "道", "物", "弟", "子", "汽", "車", "何", "黒", "分", "時", "屋", "音", "目", "行",
    "絵", "月", "野", "外", "図", "部", "小", "風", "魔", "元", "太", "陽", "実", "赤", "雪", "谷",
    "通", "○", "×", "長", "話", "色", "光", "合", "青", "黄", "♪", "当", "数", "兄", "用", "心",
    "今", "正", "直", "全", "体", "夜", "面", "虫", "ｘ", "<79>", "<7A>", "<7B>", "<7C>", "<7D>", "<7E>", "<7F>",
    "<80>", "<81>", "<82>", "<83>", "<84>", "<85>", "<86>", "<87>", "<88>", "<89>", "<8A>", "<8B>", "<8C>", "<8D>", "<8E>", "<8F>",
    "<90>", "<91>", "<92>", "<93>", "<94>", "<95>", "<96>", "<97>", "<98>", "<99>", "<9A>", "<9B>", "<9C>", "<9D>", "<9E>", "<9F>",
    "<A0>", "<A1>", "<A2>", "<A3>", "<A4>", "<A5>", "<A6>", "<A7>", "<A8>", "<A9>", "<AA>", "<AB>", "<AC>", "<AD>", "<AE>", "<AF>",
    "<B0>", "<B1>", "<B2>", "<B3>", "<B4>", "<B5>", "<B6>", "<B7>", "<B8>", "<B9>", "<BA>", "<BB>", "<BC>", "<BD>", "<BE>", "<BF>",
    "<C0>", "<C1>", "<C2>", "<C3>", "<C4>", "<C5>", "<C6>", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<br>", "<wait>", NULL, "<kana>", "<latin>", "<kanji>", "<icon>", "　", "<F8>", "<F9>", "<FA>", "<scroll>", NULL, NULL, "<FE>", NULL
};

const char * const icon[256] = {
    "<A>", "<B>", "<Start>", "<C-Up>", "<C-Down>", "<C-Left>", "<C-Right>", "<Z>", "<L>", "<R>", "<0A>", "<0B>", "<0C>", "<0D>", "<0E>", "<0F>",
    "<10>", "<11>", "<12>", "<13>", "<14>", "<15>", "<16>", "<17>", "<18>", "<19>", "<1A>", "<1B>", "<1C>", "<1D>", "<1E>", "<1F>",
    "<20>", "<21>", "<22>", "<23>", "<24>", "<25>", "<26>", "<27>", "<28>", "<29>", "<2A>", "<2B>", "<2C>", "<2D>", "<2E>", "<2F>",
    "<30>", "<31>", "<32>", "<33>", "<34>", "<35>", "<36>", "<37>", "<38>", "<39>", "<3A>", "<3B>", "<3C>", "<3D>", "<3E>", "<3F>",
    "<40>", "<41>", "<42>", "<43>", "<44>", "<45>", "<46>", "<47>", "<48>", "<49>", "<4A>", "<4B>", "<4C>", "<4D>", "<4E>", "<4F>",
    "<50>", "<51>", "<52>", "<53>", "<54>", "<55>", "<56>", "<57>", "<58>", "<59>", "<5A>", "<5B>", "<5C>", "<5D>", "<5E>", "<5F>",
    "<60>", "<61>", "<62>", "<63>", "<64>", "<65>", "<66>", "<67>", "<68>", "<69>", "<6A>", "<6B>", "<6C>", "<6D>", "<6E>", "<6F>",
    "<70>", "<71>", "<72>", "<73>", "<74>", "<75>", "<76>", "<77>", "<78>", "<79>", "<7A>", "<7B>", "<7C>", "<7D>", "<7E>", "<7F>",
    "<80>", "<81>", "<82>", "<83>", "<84>", "<85>", "<86>", "<87>", "<88>", "<89>", "<8A>", "<8B>", "<8C>", "<8D>", "<8E>", "<8F>",
    "<90>", "<91>", "<92>", "<93>", "<94>", "<95>", "<96>", "<97>", "<98>", "<99>", "<9A>", "<9B>", "<9C>", "<9D>", "<9E>", "<9F>",
    "<A0>", "<A1>", "<A2>", "<A3>", "<A4>", "<A5>", "<A6>", "<A7>", "<A8>", "<A9>", "<AA>", "<AB>", "<AC>", "<AD>", "<AE>", "<AF>",
    "<B0>", "<B1>", "<B2>", "<B3>", "<B4>", "<B5>", "<B6>", "<B7>", "<B8>", "<B9>", "<BA>", "<BB>", "<BC>", "<BD>", "<BE>", "<BF>",
    "<C0>", "<C1>", "<C2>", "<C3>", "<C4>", "<C5>", "<C6>", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<br>", "<wait>", NULL, "<kana>", "<latin>", "<kanji>", "<icon>", "　", "<F8>", "<F9>", "<FA>", "<scroll>", NULL, NULL, "<FE>", NULL
};

const char * const latin[256] = {
    "♪", "!", "\"", "#", "$", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/",
    "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", "<1C>", "=", "<1E>", "?",
    "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
    "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "¥", "]", "^", "_",
    "‘", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
    "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "|", "}", "~", "º",
    "À", "Á", "Â", "Ä", "Ç", "È", "É", "Ê", "Ë", "Ì", "Í", "Î", "Ï", "Ñ", "Ò", "Ó",
    "Ô", "Ö", "Ù", "Ú", "Û", "Ü", "ß", "à", "á", "â", "ä", "ç", "è", "é", "ê", "ë",
    "ì", "í", "î", "ï", "ñ", "ò", "ó", "ô", "ö", "ù", "ú", "û", "ü", "¡", "¿", "ª",
    "♡", "☆", "⇧", "⇩", "⇦", "⇨", "○", "×", "<A>", "<B>", "<L>", "<R>", "<Z>", "<C-Up>", "<C-Down>", "<C-Left>",
    "<C-Right>", "<Start>", "<A2>", "<A3>", "<A4>", "<A5>", "<A6>", "<A7>", "<A8>", "<A9>", "<AA>", "<AB>", "<AC>", "<AD>", "<AE>", "<AF>",
    "<B0>", "<B1>", "<B2>", "<B3>", "<B4>", "<B5>", "<B6>", "<B7>", "<B8>", "<B9>", "<BA>", "<BB>", "<BC>", "<BD>", "<BE>", "<BF>",
    "<C0>", "<C1>", "<C2>", "<C3>", "<C4>", "<C5>", "<C6>", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<br>", "<wait>", NULL, "<F3>", "<F4>", "<F5>", "<F6>", " ", "<F8>", "<F9>", "<FA>", "<scroll>", NULL, NULL, "<FE>", NULL
};

/*
const char * const latin[256] = {
    "<00>", "!", "\"", "<03>", "<04>", "<05>", "<06>", "'", "<08>", "<09>", "<0A>", "<0B>", ",", "<0D>", ".", "<0F>",
    "<10>", "<11>", "<12>", "<13>", "<14>", "<15>", "<16>", "<17>", "<18>", "<19>", "<1A>", "<1B>", "<1C>", "<1D>", "<1E>", "<1F>",
    "<20>", "<21>", "<22>", "<23>", "<24>", "<25>", "<26>", "<27>", "<28>", "<29>", "<2A>", "<2B>", "<2C>", "<2D>", "<2E>", "<2F>",
    "<30>", "<31>", "<32>", "<33>", "<34>", "<35>", "<36>", "<37>", "<38>", "<39>", "<3A>", "<3B>", "<3C>", "<3D>", "<3E>", "<3F>",
    "<40>", "<41>", "<42>", "<43>", "<44>", "<45>", "<46>", "<47>", "<48>", "<49>", "<4A>", "<4B>", "<4C>", "<4D>", "<4E>", "<4F>",
    "<50>", "<51>", "<52>", "<53>", "<54>", "<55>", "<56>", "<57>", "<58>", "<59>", "<5A>", "<5B>", "<5C>", "<5D>", "<5E>", "<5F>",
    "<60>", "<61>", "<62>", "<63>", "<64>", "<65>", "<66>", "<67>", "<68>", "<69>", "<6A>", "<6B>", "<6C>", "<6D>", "<6E>", "<6F>",
    "<70>", "<71>", "<72>", "<73>", "<74>", "<75>", "<76>", "<77>", "<78>", "<79>", "<7A>", "<7B>", "<7C>", "<7D>", "<7E>", "<7F>",
    "<80>", "<81>", "<82>", "<83>", "<84>", "<85>", "<86>", "<87>", "<88>", "<89>", "<8A>", "<8B>", "<8C>", "<8D>", "<8E>", "<8F>",
    "<90>", "<91>", "<92>", "<93>", "<94>", "<95>", "<96>", "<97>", "<98>", "<99>", "<9A>", "<9B>", "<9C>", "<9D>", "<9E>", "<9F>",
    "<A0>", "<A1>", "<A2>", "<A3>", "<A4>", "<A5>", "<A6>", "<A7>", "<A8>", "<A9>", "<AA>", "<AB>", "<AC>", "<AD>", "<AE>", "<AF>",
    "<B0>", "<B1>", "<B2>", "<B3>", "<B4>", "<B5>", "<B6>", "<B7>", "<B8>", "<B9>", "<BA>", "<BB>", "<BC>", "<BD>", "<BE>", "<BF>",
    "<C0>", "<C1>", "<C2>", "<C3>", "<C4>", "<C5>", "<C6>", "<C7>", "<C8>", "<C9>", "<CA>", "<CB>", "<CC>", "<CD>", "<CE>", "<CF>",
    "<D0>", "<D1>", "<D2>", "<D3>", "<D4>", "<D5>", "<D6>", "<D7>", "<D8>", "<D9>", "<DA>", "<DB>", "<DC>", "<DD>", "<DE>", "<DF>",
    "<E0>", "<E1>", "<E2>", "<E3>", "<E4>", "<E5>", "<E6>", "<E7>", "<E8>", "<E9>", "<EA>", "<EB>", "<EC>", "<ED>", "<EE>", "<EF>",
    "<F0>", "<F1>", NULL, "<F3>", "<F4>", "<F5>", "<F6>", "<F7>", "<F8>", "<F9>", "<FA>", "<FB>", NULL, NULL, "<FE>", NULL
};
*/

const char * const * const japan[] = { kana, latin_j, kanji, icon };
const char * const * const international[] = { latin, latin, latin, latin };

const char * const * const * const table[] = { japan, international };

void decode( FILE * romfile, uint32_t main_offset, uint_fast8_t region )
{
    uint_fast32_t section_index = 0;
    fseek( romfile, main_offset + section_index * 4, SEEK_SET );
    uint32_t section_offset = checked_fget32( romfile );
    while( section_offset )
    {
        uint_fast32_t line_index = 0;
        fseek( romfile, main_offset + section_offset + line_index * 4, SEEK_SET );
        uint32_t line_offset = checked_fget32( romfile );
        while( line_offset != section_offset )
        {
            fprintf( stdout, "%02" PRIuFAST32 "-%03" PRIuFAST32 " : ", section_index, line_index );
            fseek( romfile, main_offset + line_offset, SEEK_SET );
            uint_fast8_t charset = 0;
            uint8_t byte = checked_fget8( romfile );
            while( byte != 0xFD )
            {
                switch( byte )
                {
                    case 0xF2:
                        fprintf( stdout, "<%02" PRIX8 " ", byte );
                        byte = checked_fget8( romfile );
                        fprintf( stdout, "%02" PRIX8 ">", byte );
                        break;
                    case 0xF3:
                    case 0xF4:
                    case 0xF5:
                    case 0xF6:
                        fprintf( stdout, "%s", table[region][charset][byte] );
                        charset = byte - 0xF3;
                        break;
                    case 0xFC:
                        fprintf( stdout, "<%02" PRIX8 " ", byte );
                        byte = checked_fget8( romfile );
                        switch( byte )
                        {
                            case 0x05:
                            case 0x0C:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            case 0x08:
                            case 0x09:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            default:
                                fprintf( stdout, "%02" PRIX8 ">", byte );
                                break;
                        }
                        break;
                    case 0xFF:
                        fprintf( stdout, "<%02" PRIX8 " ", byte );
                        byte = checked_fget8( romfile );
                        switch( byte )
                        {
                            case 0x26:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                switch( byte )
                                {
                                    case 0x03:
                                    case 0x05:
                                    case 0x07:
                                        fprintf( stdout, "%02" PRIX8 " ", byte );
                                        byte = checked_fget8( romfile );
                                    default:
                                        fprintf( stdout, "%02" PRIX8 ">", byte );
                                        break;
                                }
                                break;
                            case 0x2C:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            case 0x18:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            case 0x16:
                            case 0x1A:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            case 0x0D:
                            case 0x0F:
                            case 0x10:
                            case 0x17:
                            case 0x1B:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            case 0x05:
                            case 0x0B:
                            case 0x0C:
                            case 0x11:
                            case 0x12:
                            case 0x13:
                            case 0x14:
                            case 0x15:
                            case 0x1C:
                            case 0x1E:
                            case 0x1F:
                            case 0x20:
                            case 0x21:
                            case 0x27:
                            case 0x28:
                            case 0x29:
                            case 0x2E:
                            case 0x2F:
                                fprintf( stdout, "%02" PRIX8 " ", byte );
                                byte = checked_fget8( romfile );
                            default:
                                fprintf( stdout, "%02" PRIX8 ">", byte );
                                break;
                        }
                        break;
                    default:
                        fprintf( stdout, "%s", table[region][charset][byte] );
                        break;
                }
                byte = checked_fget8( romfile );
            }
            fprintf( stdout, "\n" );
            ++line_index;
            fseek( romfile, main_offset + section_offset + line_index * 4, SEEK_SET );
            line_offset = checked_fget32( romfile );
        }
        ++section_index;
        fseek( romfile, main_offset + section_index * 4, SEEK_SET );
        section_offset = checked_fget32( romfile );
    }
}
